<%@ taglib prefix="tiles" uri="http://tiles.apache.org/tags-tiles" %>
<%@ page language="java" contentType="text/html; charset=UTF-8"
         pageEncoding="UTF-8" import="java.util.*" %>
<!DOCTYPE html>
<html>
<head>
    <title>task8-two</title>
    <meta charset="utf-8" name="viewport" content="width=device-width"
          initial-scale=1 maximum-scale=1 minimum-scale=1 user-scalable=no>
    <link rel="stylesheet" href="/view/part4/css/two.css">
    <link href="http://how2j.cn/study/css/bootstrap/3.3.6/bootstrap.min.css"
          rel="stylesheet">
</head>
<body>

<div class="header-end"></div>
<!--main-->
<main>
    <!--main-top-->
    <div class="main-top">
        <p class="main-top-left">
            <a href="/task4/home">首页</a>>
        </p>
        <p class="main-top-right">合作企业</p>
    </div>
    <!--main-left-->
    <div class="main">
        <div class="main-left">
            <p>合作企业</p>
            <div class="main-left-link">
                <a href="#">阿里巴巴</a>
                <a href="#">腾讯视频</a>
                <a href="#">土豆网</a>
                <a href="#">北京葡萄藤</a>
                <a href="#">阿里巴巴</a>
                <a href="#">腾讯视频</a>
                <a href="#">土豆网</a>
                <a href="#">北京葡萄藤</a>
                <a href="#">阿里巴巴</a>
                <a href="#">腾讯视频</a>
                <a href="#">土豆网</a>
                <a href="#">北京葡萄藤</a>
            </div>
        </div>
        <!--main-right-->
        <div class="right-fix">
            <div class="main-right-top">
                <div class="tudou-logo">
                    <img src="/view/part4/img/two/tudou.png">
                </div>
                土豆网公司成立于1998年11月，是目前中国最大的互联网综合服务提供商之
                一，也是中国服务用户最多的互联网企业之一，成立10多年以来，腾讯一直
                秉承一切以用户价值为依归的经营理念，始	终处于稳健、高速发展的状态。
                2004年6月16日，腾讯公司在香港联交所主板公开上市（股票代号700）。
            </div>
            <div class="main-right-other">
                <p>土豆是中国最早和最具影响力的网络视频平台，是中国网络视频行业的
                    领军品牌，其前身土豆网于2005年4月15日正式上线，是全球最早上线的视
                    频网站之一。2014年1月，"土豆网"正式更名为"土豆"，标志着土豆进入品
                    牌发展的新阶段。</p>
                <p>土豆是中国最早和最具影响力的网络视频平台，是中国网络视频行业的
                    领军品牌，其前身土豆网于2005年4月15日正式上线，是全球最早上线的视
                    频网站之一。2014年1月，"土豆网"正式更名为"土豆"，标志着土豆进入品
                    牌发展的新阶段。</p>
                <p>土豆是中国最早和最具影响力的网络视频平台，是中国网络视频行业的
                    领军品牌，其前身土豆网于2005年4月15日正式上线，是全球最早上线的视
                    频网站之一。2014年1月，"土豆网"正式更名为"土豆"，标志着土豆进入品
                    牌发展的新阶段。</p>
                <p>土豆是中国最早和最具影响力的网络视频平台，是中国网络视频行业的
                    领军品牌，其前身土豆网于2005年4月15日正式上线，是全球最早上线的视
                    频网站之一。2014年1月，"土豆网"正式更名为"土豆"，标志着土豆进入品
                    牌发展的新阶段。</p>
                <p>土豆是中国最早和最具影响力的网络视频平台，是中国网络视频行业的
                    领军品牌，其前身土豆网于2005年4月15日正式上线，是全球最早上线的视
                    频网站之一。2014年1月，"土豆网"正式更名为"土豆"，标志着土豆进入品
                    牌发展的新阶段。</p>
                <p>土豆是中国最早和最具影响力的网络视频平台，是中国网络视频行业的
                    领军品牌，其前身土豆网于2005年4月15日正式上线，是全球最早上线的视
                    频网站之一。2014年1月，"土豆网"正式更名为"土豆"，标志着土豆进入品
                    牌发展的新阶段。</p>
                <p>土豆是中国最早和最具影响力的网络视频平台，是中国网络视频行业的
                    领军品牌，其前身土豆网于2005年4月15日正式上线，是全球最早上线的视
                    频网站之一。2014年1月，"土豆网"正式更名为"土豆"，标志着土豆进入品
                    牌发展的新阶段。</p>
                <p>土豆是中国最早和最具影响力的网络视频平台，是中国网络视频行业的
                    领军品牌，其前身土豆网于2005年4月15日正式上线，是全球最早上线的视
                    频网站之一。2014年1月，"土豆网"正式更名为"土豆"，标志着土豆进入品
                    牌发展的新阶段。</p>
                <p>土豆是中国最早和最具影响力的网络视频平台，是中国网络视频行业的
                    领军品牌，其前身土豆网于2005年4月15日正式上线，是全球最早上线的视
                    频网站之一。2014年1月，"土豆网"正式更名为"土豆"，标志着土豆进入品
                    牌发展的新阶段。</p>
                <p>土豆是中国最早和最具影响力的网络视频平台，是中国网络视频行业的
                    领军品牌，其前身土豆网于2005年4月15日正式上线，是全球最早上线的视
                    频网站之一。2014年1月，"土豆网"正式更名为"土豆"，标志着土豆进入品
                    牌发展的新阶段。</p>
                <p>土豆是中国最早和最具影响力的网络视频平台，是中国网络视频行业的
                    领军品牌，其前身土豆网于2005年4月15日正式上线，是全球最早上线的视
                    频网站之一。2014年1月，"土豆网"正式更名为"土豆"，标志着土豆进入品
                    牌发展的新阶段。</p>
                <p>土豆是中国最早和最具影响力的网络视频平台，是中国网络视频行业的
                    领军品牌，其前身土豆网于2005年4月15日正式上线，是全球最早上线的视
                    频网站之一。2014年1月，"土豆网"正式更名为"土豆"，标志着土豆进入品
                    牌发展的新阶段。</p>
            </div>
        </div>
    </div>
</main>
<!--footer-->


</body>
</html>
